/****************************************************************************************************************************************************************
** 版权:          2017-2027,深圳市信为科技发展有限公司
** 文件名:        stm32l0_dac_app.c
** 作者:          庄明群
** 版本:          V1.0.0
** 日期:          2017-08-01
** 描述:          DAC应用实例
** 功能:          DAC通道选择与初始化
*****************************************************************************************************************************************************************
** 修改者:        No
** 版本:          No
** 修改内容:      No
** 日期:          No
****************************************************************************************************************************************************************/

#include "stm32l0_dac_app.h"
#include "stm32l0_adc_app.h"

//****************************************************************************************************************************************************************
// 名称               : DAC_Chn_Selection()
// 创建日期           : 2017-08-01
// 作者               : 庄明群
// 功能               : DAC通道选择与初始化
// 输入参数           : 无
// 输出参数           : 无
// 返回结果           : 无
// 注意和说明         : DAC_Chn_ConfigTypeDef定义的变量可以为局部变量
// 修改内容           :
//****************************************************************************************************************************************************************

void DAC_Chn_Selection(void)
{
  DAC_Chn_ConfigTypeDef DAC_Chn_ConfigStructure;
  //通道1使能
  DAC_Chn_ConfigStructure.DAC_OUT0_State = ENABLE;
  //通道2使能
  DAC_Chn_ConfigStructure.DAC_OUT1_State = ENABLE;
  //通道初始化
  DAC_Chn_Init(&DAC_Chn_ConfigStructure);
}

//****************************************************************************************************************************************************************
// 名称               : DAC_Chn_Handle()
// 创建日期           : 2017-08-01
// 作者               : 庄明群
// 功能               : DAC通道数据转换
// 输入参数           : 无
// 输出参数           : 无
// 返回结果           : 无
// 注意和说明         : 
// 修改内容           :
//****************************************************************************************************************************************************************

void DAC_Chn_Handle(void)
{
  if((DAOUTCLIB_ENABLE != ProductParam.CapDA_ClibEn) && (ADCLIB_ENABLE != ProductParam.CapAD_ClibEn) && (FRESH_OK == RunVarParam.CapDA_Fresh_Flag))
  {
    DAC_Chn_SetValue(RunVarParam.CapDA_OutValue, 1);
    RunVarParam.CapDA_Fresh_Flag = FRESH_NK;
  }
  
  //如果没有温度DA标定动作,就DA输出
  if((DAOUTCLIB_ENABLE != ProductParam.TempDA_ClibEn) && (FRESH_OK == RunVarParam.Temper_Fresh_Flag))
  {
    //将温度转换成对应DA输出
    DAC_Chn_SetValue(RunVarParam.TemperInAirAD, 2);
    RunVarParam.Temper_Fresh_Flag = FRESH_NK;
  }
}
