/****************************************************************************************************************************************************************
** 版权:          2017-2027,深圳市信为科技发展有限公司
** 文件名:        DataOutput.c
** 作者:          庄明群
** 版本:          V1.0.0
** 日期:          2017-05-22
** 描述:          电容数据输出
** 功能:          电容滤波、数据转换、数据输出
*****************************************************************************************************************************************************************
** 修改者:        No
** 版本:          No
** 修改内容:      No
** 日期:          No
****************************************************************************************************************************************************************/

#ifndef __DATAOUTPUT_H
#define __DATAOUTPUT_H

#include "Picocap.h"
#include "stm32l0_timer_app.h"
#include "VariaType.h"
#include "stdlib.h"

//#define FILTER_GROUP_MAX                        100                                  //滤波数组缓存大小

//****************************************************************************************************************************************************************
// 名称               :GetPCapResult()
// 创建日期           :2017-05-22
// 作者               :庄明群
// 功能               :获取PCap原始采集值
// 输入参数           :无
// 输出参数           :无
// 返回结果           :无
// 注意和说明         :
// 修改内容           :
//****************************************************************************************************************************************************************
void GetPCapResult(void);

//****************************************************************************************************************************************************************
// 名称               :DataFilterAndOutput()
// 创建日期           :2017-05-22
// 作者               :庄明群
// 功能               :PCap采集值滤波与输出
// 输入参数           :无
// 输出参数           :无
// 返回结果           :无
// 注意和说明         :
// 修改内容           :
//****************************************************************************************************************************************************************

void DataFilterAndOutput(void);

extern uint8_t ReceiveData;
extern uint8_t UsartRecvOk;
extern UserParaTypeDef UserParam;
extern UsartParaTypeDef UsartParam;
extern RunVarParaTypeDef RunVarParam;
extern ProductParaTypeDef ProductParam;
extern TIM_HandleTypeDef TIM2_HandleInitStruct;
extern TIM_HandleTypeDef TIM3_HandleInitStruct;

#endif
